app/Http/Controllers/PlaylistController.php

    public function edit(Playlist $playlist)
    {
        Playlist::where('active',1 )
            ->andWhere()
            ->orderBy('id', 'DESC')
            ->paginate();
        //$videos = Auth::user()->videos;
        $playlist->with('videos')->get();
---
select `videos`.*, `playlists_videos`.`playlist_id` as `pivot_playlist_id`, `playlists_videos`.`movie_id` as `pivot_movie_id` from `videos` inner join `playlists_videos` on `videos`.`id` = `playlists_videos`.`movie_id` where `playlists_videos`.`playlist_id` in (1, 2, 5)